---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertTempToDouble
source: html/4e99047d-0db0-126f-09bd-ff0b2ac11462.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConversionFailures.CannotConvertTempToDouble Property

Cannot convert temperature '[Temperate Value]' to double value

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConvertTempToDouble { get; }
```